[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:61:5
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       id: "isSection",
     },
-    {
-      Header: "Status",
-      accessor: (row) => {
-        if (isSectionCancelled(row.section)) return "CANCELLED";
-        else if (isSectionClosed(row.section)) return "CLOSED";
-        else if (isSectionFull(row.section)) return "FULL";
-        else return "OPEN";
-      },
-      disableGroupBy: true,
-      id: "status",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Enrolled",
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:67:21
         if (isSectionCancelled(row.section)) return "CANCELLED";
         else if (isSectionClosed(row.section)) return "CLOSED";
         else if (isSectionFull(row.section)) return "FULL";
-        else return "OPEN";
+        else return "";
       },
       disableGroupBy: true,
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  OPEN
Received:
