[Killed] BlockStatement
src/main/utils/sectionUtils.js:80:43
   }
 };
 
-export const isSectionFull = (section) => {
-  return section.enrolledTotal >= section.maxEnroll;
-};
+export const isSectionFull = (section) => {};
 
 export const isSectionClosed = (section) => {
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  FULL
Received:
  OPEN

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:81:10
 };
 
 export const isSectionFull = (section) => {
-  return section.enrolledTotal >= section.maxEnroll;
+  return false;
 };
 
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  FULL
Received:
  OPEN

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:81:10
 };
 
 export const isSectionFull = (section) => {
-  return section.enrolledTotal >= section.maxEnroll;
+  return section.enrolledTotal > section.maxEnroll;
 };
 
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  FULL
Received:
  OPEN

[Killed] BlockStatement
src/main/utils/sectionUtils.js:84:45
   return section.enrolledTotal >= section.maxEnroll;
 };
 
-export const isSectionClosed = (section) => {
-  return section.classClosed !== null;
-};
+export const isSectionClosed = (section) => {};
 
 export const isSectionCancelled = (section) => {
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CLOSED
Received:
  FULL

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:85:10
 };
 
 export const isSectionClosed = (section) => {
-  return section.classClosed !== null;
+  return false;
 };
 
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CLOSED
Received:
  FULL

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:85:10
 };
 
 export const isSectionClosed = (section) => {
-  return section.classClosed !== null;
+  return section.classClosed === null;
 };
 
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  OPEN
Received:
  CLOSED

[Killed] BlockStatement
src/main/utils/sectionUtils.js:88:48
   return section.classClosed !== null;
 };
 
-export const isSectionCancelled = (section) => {
-  return section.courseCancelled !== null;
-};
+export const isSectionCancelled = (section) => {};
 
 
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CANCELLED
Received:
  FULL

[Killed] ConditionalExpression
src/main/utils/sectionUtils.js:89:10
 };
 
 export const isSectionCancelled = (section) => {
-  return section.courseCancelled !== null;
+  return false;
 };
 
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CANCELLED
Received:
  FULL

[Killed] EqualityOperator
src/main/utils/sectionUtils.js:89:10
 };
 
 export const isSectionCancelled = (section) => {
-  return section.courseCancelled !== null;
+  return section.courseCancelled === null;
 };
 
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  OPEN
Received:
  CANCELLED
