[Killed] BlockStatement
src/main/components/SectionsInstructorTableBase.js:43:48
           prepareRow(row);
           return (
             <tr {...row.getRowProps()}>
-              {row.cells.map((cell, _index) => {
-                return (
-                  <td
-                    {...cell.getCellProps()}
-                    data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                    // Stryker disable next-line ObjectLiteral
-                    style={{
-                      background:
-                        data[cell.row.index].section.section % 100 === 0 //Checks if the row we have is a section by seeing if "section" field ends in "00"
-                          ? "#34859b"
-                          : "#9dbfbe",
-                      color:
-                        data[cell.row.index].section.section % 100 === 0
-                          ? "#effcf4"
-                          : "#000000",
-                      fontWeight:
-                        data[cell.row.index].section.section % 100 === 0
-                          ? "bold"
-                          : "normal",
-                    }}
-                  >
-                    {cell.render("Cell")}
-                  </td>
-                );
-              })}
+              {row.cells.map((cell, _index) => {})}
             </tr>
           );
killedBy: CourseOverTimeInstructorIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
src/main/components/SectionsInstructorTableBase.js:51:25
                     // Stryker disable next-line ObjectLiteral
                     style={{
                       background:
-                        data[cell.row.index].section.section % 100 === 0 //Checks if the row we have is a section by seeing if "section" field ends in "00"
+                        false //Checks if the row we have is a section by seeing if "section" field ends in "00"
                           ? "#34859b"
                           : "#9dbfbe",
killedBy: SectionsInstructorTableBase tests renders a single lecture section correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;") // element.getAttribute("style") === "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"
Received:
  style="backgroun

[Killed] ConditionalExpression
src/main/components/SectionsInstructorTableBase.js:51:25
                     // Stryker disable next-line ObjectLiteral
                     style={{
                       background:
-                        data[cell.row.index].section.section % 100 === 0 //Checks if the row we have is a section by seeing if "section" field ends in "00"
+                        true //Checks if the row we have is a section by seeing if "section" field ends in "00"
                           ? "#34859b"
                           : "#9dbfbe",
killedBy: SectionsInstructorTableBase tests renders a discussion section correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(157, 191, 190); color: rgb(0, 0, 0); font-weight: normal;") // element.getAttribute("style") === "background: rgb(157, 191, 190); color: rgb(0, 0, 0); font-weight: normal;"

Expected the element to have attribute:
  style="background: rgb(157, 191, 190); color: rgb(0, 0, 0); font-weight: normal;"
Received:
  style="background: rgb(52

[Killed] ConditionalExpression
src/main/components/SectionsInstructorTableBase.js:55:25
                           ? "#34859b"
                           : "#9dbfbe",
                       color:
-                        data[cell.row.index].section.section % 100 === 0
+                        false
                           ? "#effcf4"
                           : "#000000",
killedBy: SectionsInstructorTableBase tests renders a single lecture section correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;") // element.getAttribute("style") === "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"
Received:
  style="backgroun

[Killed] ArithmeticOperator
src/main/components/SectionsInstructorTableBase.js:55:25
                           ? "#34859b"
                           : "#9dbfbe",
                       color:
-                        data[cell.row.index].section.section % 100 === 0
+                        data[cell.row.index].section.section * 100 === 0
                           ? "#effcf4"
                           : "#000000",
killedBy: SectionsInstructorTableBase tests renders a single lecture section correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;") // element.getAttribute("style") === "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"
Received:
  style="backgroun

[Killed] ConditionalExpression
src/main/components/SectionsInstructorTableBase.js:59:25
                           ? "#effcf4"
                           : "#000000",
                       fontWeight:
-                        data[cell.row.index].section.section % 100 === 0
+                        true
                           ? "bold"
                           : "normal",
killedBy: SectionsInstructorTableBase tests renders a discussion section correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(157, 191, 190); color: rgb(0, 0, 0); font-weight: normal;") // element.getAttribute("style") === "background: rgb(157, 191, 190); color: rgb(0, 0, 0); font-weight: normal;"

Expected the element to have attribute:
  style="background: rgb(157, 191, 190); color: rgb(0, 0, 0); font-weight: normal;"
Received:
  style="background: rgb(15

[Killed] EqualityOperator
src/main/components/SectionsInstructorTableBase.js:59:25
                           ? "#effcf4"
                           : "#000000",
                       fontWeight:
-                        data[cell.row.index].section.section % 100 === 0
+                        data[cell.row.index].section.section % 100 !== 0
                           ? "bold"
                           : "normal",
killedBy: SectionsInstructorTableBase tests renders a single lecture section correctly
statusReason: Error: expect(element).toHaveAttribute("style", "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;") // element.getAttribute("style") === "background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"

Expected the element to have attribute:
  style="background: rgb(52, 133, 155); color: rgb(239, 252, 244); font-weight: bold;"
Received:
  style="backgroun
