[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:14:5
 
 export default function SectionsInstructorTable({ sections }) {
   const columns = [
-    {
-      Header: "Course ID",
-      accessor: "courseInfo.courseId",
-
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
-    },
+    {},
     {
       Header: "Quarter",
killedBy: CourseOverTimeInstructorIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:20:5
 
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
     },
-    {
-      Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
-      id: "quarter",
-    },
+    {},
     {
       Header: "Title",
killedBy: CourseOverTimeInstructorIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:40:5
       accessor: (row) => formatLocation(row.section.timeLocations),
       id: "location",
     },
-    {
-      Header: "Days",
-      accessor: (row) => formatDays(row.section.timeLocations),
-      id: "days",
-    },
+    {},
     {
       Header: "Time",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsInstructorTable.js:45:5
       accessor: (row) => formatDays(row.section.timeLocations),
       id: "days",
     },
-    {
-      Header: "Time",
-      accessor: (row) => formatTime(row.section.timeLocations),
-      id: "time",
-    },
+    {},
     {
       Header: "Instructor",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsInstructorTable.js:61:18
     },
   ];
 
-  const testid = "SectionsInstructorTable";
+  const testid = "";
 
   return (
killedBy: Section tests Has the expected column headers and content for both lecture and section
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsInstructorTable-cell-row-0-col-quarter"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
