[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:43:44
       disableGroupBy: true,
 
       aggregate: getCourseId,
-      Aggregated: ({ cell: { value } }) => `${value}`,
+      Aggregated: ({ cell: { value } }) => ``,
 
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:62:5
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       id: "isSection",
     },
-    {
-      Header: "Info",
-      Cell: ({ cell }) => (
-        <Button
-          variant={"primary"}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        >
-          {"ℹ"}
-        </Button>
-      ),
-    },
+    {},
     {
       Header: "Status",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Sections/SectionsOverTimeTable.js:64:13
     },
     {
       Header: "Info",
-      Cell: ({ cell }) => (
-        <Button
-          variant={"primary"}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        >
-          {"ℹ"}
-        </Button>
-      ),
+      Cell: () => undefined,
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
