[Killed] BlockStatement
main/components/Sections/SectionsOverTimeTable.js:21:33
   return values[0];
 }
 
-function getCourseId(courseIds) {
-  return courseIds[0].substring(0, courseIds[0].length - 2);
-}
+function getCourseId(courseIds) {}
 
 export default function SectionsOverTimeTable({ sections }) {
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArithmeticOperator
main/components/Sections/SectionsOverTimeTable.js:22:36
 }
 
 function getCourseId(courseIds) {
-  return courseIds[0].substring(0, courseIds[0].length - 2);
+  return courseIds[0].substring(0, courseIds[0].length + 2);
 }
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] MethodExpression
main/components/Sections/SectionsOverTimeTable.js:22:10
 }
 
 function getCourseId(courseIds) {
-  return courseIds[0].substring(0, courseIds[0].length - 2);
+  return courseIds[0];
 }
 
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:43:11
       Header: "Quarter",
       accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
       disableGroupBy: true,
-      id: "quarter",
+      id: "",
 
       Cell: ({ cell: { value } }) => value,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-0-col-quarter"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ArrowFunction
main/components/Sections/SectionsOverTimeTable.js:45:13
       disableGroupBy: true,
       id: "quarter",
 
-      Cell: ({ cell: { value } }) => value,
+      Cell: () => undefined,
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
main/components/Sections/SectionsOverTimeTable.js:53:19
       disableGroupBy: true,
 
       aggregate: getCourseId,
-      Aggregated: ({ cell: { value } }) => `${value}`,
+      Aggregated: () => undefined,
 
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
killedBy: CourseOverTimeIndexPage tests calls UCSB Course over time search api correctly with 3 section response
statusReason: TestingLibraryElementError: Unable to find an element with the text: ECE 1A. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div />
</body>

[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:72:5
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
       id: "isSection",
     },
-    {
-      Header: "Info",
-      Cell: ({ cell }) => (
-        <Button
-          variant={"primary"}
-          onClick={() => infoCallback(cell)}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        >
-          {"ℹ"}
-        </Button>
-      ),
-    },
+    {},
     {
       Header: "Status",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:73:15
       id: "isSection",
     },
     {
-      Header: "Info",
+      Header: "",
       Cell: ({ cell }) => (
         <Button
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/Sections/SectionsOverTimeTable.js:74:13
     },
     {
       Header: "Info",
-      Cell: ({ cell }) => (
-        <Button
-          variant={"primary"}
-          onClick={() => infoCallback(cell)}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-        >
-          {"ℹ"}
-        </Button>
-      ),
+      Cell: () => undefined,
     },
     {
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: Component(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:76:20
       Header: "Info",
       Cell: ({ cell }) => (
         <Button
-          variant={"primary"}
+          variant={""}
           onClick={() => infoCallback(cell)}
           data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] ArrowFunction
main/components/Sections/SectionsOverTimeTable.js:77:20
       Cell: ({ cell }) => (
         <Button
           variant={"primary"}
-          onClick={() => infoCallback(cell)}
+          onClick={() => undefined}
           data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
         >
killedBy: Section tests Info button navigates to the course details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/coursedetails/20222/08078"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:80:12
           onClick={() => infoCallback(cell)}
           data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
         >
-          {"ℹ"}
+          {""}
         </Button>
       ),
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ℹ
Received:

[Killed] BlockStatement
main/components/Sections/SectionsOverTimeTable.js:86:26
     },
     {
       Header: "Status",
-      accessor: (row) => {
-        if (isSectionCancelled(row.section)) return "CANCELLED";
-        else if (isSectionClosed(row.section)) return "CLOSED";
-        else if (isSectionFull(row.section)) return "FULL";
-        else return "OPEN";
-      },
+      accessor: (row) => {},
       disableGroupBy: true,
       id: "status",
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CLOSED
Received:
  undefined

[Killed] ConditionalExpression
main/components/Sections/SectionsOverTimeTable.js:87:13
     {
       Header: "Status",
       accessor: (row) => {
-        if (isSectionCancelled(row.section)) return "CANCELLED";
+        if (false) return "CANCELLED";
         else if (isSectionClosed(row.section)) return "CLOSED";
         else if (isSectionFull(row.section)) return "FULL";
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CANCELLED
Received:
  FULL

[Killed] ConditionalExpression
main/components/Sections/SectionsOverTimeTable.js:87:13
     {
       Header: "Status",
       accessor: (row) => {
-        if (isSectionCancelled(row.section)) return "CANCELLED";
+        if (true) return "CANCELLED";
         else if (isSectionClosed(row.section)) return "CLOSED";
         else if (isSectionFull(row.section)) return "FULL";
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CLOSED
Received:
  CANCELLED

[Killed] ConditionalExpression
main/components/Sections/SectionsOverTimeTable.js:88:18
       Header: "Status",
       accessor: (row) => {
         if (isSectionCancelled(row.section)) return "CANCELLED";
-        else if (isSectionClosed(row.section)) return "CLOSED";
+        else if (false) return "CLOSED";
         else if (isSectionFull(row.section)) return "FULL";
         else return "OPEN";
killedBy: Section tests Has the expected cell values when expanded
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  CLOSED
Received:
  OPEN

[Killed] ConditionalExpression
main/components/Sections/SectionsOverTimeTable.js:88:18
       Header: "Status",
       accessor: (row) => {
         if (isSectionCancelled(row.section)) return "CANCELLED";
-        else if (isSectionClosed(row.section)) return "CLOSED";
+        else if (true) return "CLOSED";
         else if (isSectionFull(row.section)) return "FULL";
         else return "OPEN";
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  FULL
Received:
  CLOSED

[Killed] ConditionalExpression
main/components/Sections/SectionsOverTimeTable.js:89:18
       accessor: (row) => {
         if (isSectionCancelled(row.section)) return "CANCELLED";
         else if (isSectionClosed(row.section)) return "CLOSED";
-        else if (isSectionFull(row.section)) return "FULL";
+        else if (false) return "FULL";
         else return "OPEN";
       },
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  FULL
Received:
  OPEN

[Killed] ConditionalExpression
main/components/Sections/SectionsOverTimeTable.js:89:18
       accessor: (row) => {
         if (isSectionCancelled(row.section)) return "CANCELLED";
         else if (isSectionClosed(row.section)) return "CLOSED";
-        else if (isSectionFull(row.section)) return "FULL";
+        else if (true) return "FULL";
         else return "OPEN";
       },
killedBy: Section tests Sections have appropriate status columns
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  OPEN
Received:
  FULL

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:139:11
       Header: "Instructor",
       accessor: (row) => formatInstructors(row.section.instructors),
       disableGroupBy: true,
-      id: "instructor",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-0-col-instructor"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:145:15
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
     {
-      Header: "Enroll Code",
+      Header: "",
       accessor: "section.enrollCode",
       disableGroupBy: true,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element with the text: Enroll Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
