[Killed] StringLiteral
main/components/Sections/SectionsTable.js:27:7
   // Stryker disable next-line all : TODO try to make a good test for this
   const infoCallback = (cell) => {
     navigate(
-      `/coursedetails/${qyyToYyyyq(cell.row.values.quarter)}/${
-        cell.row.values["section.enrollCode"]
-      }`,
+      ``,
     );
   };
killedBy: Section tests Info button navigates to the course details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/coursedetails/20221/12583"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:123:11
       Header: "Time",
       accessor: (row) => formatTime(row.section.timeLocations),
       disableGroupBy: true,
-      id: "time",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-time"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:128:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Instructor",
-      accessor: (row) => formatInstructors(row.section.instructors),
-      disableGroupBy: true,
-      id: "instructor",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Enroll Code",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:137:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Enroll Code",
-      accessor: "section.enrollCode",
-      disableGroupBy: true,
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
   ];
 
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
