[Timeout] BlockStatement
src/main/utils/quarterUtilities.js:19:29
   )}`;
 };
 
-const qyyToYyyyq = (qyy) => {
-  return `20${qyy.substring(1, 3)}${shortQuarters.indexOf(qyy.charAt(0)) + 1}`;
-};
+const qyyToYyyyq = (qyy) => {};
 
 const toFormat = (quarter, year) => {

[Timeout] MethodExpression
src/main/utils/quarterUtilities.js:20:59
 };
 
 const qyyToYyyyq = (qyy) => {
-  return `20${qyy.substring(1, 3)}${shortQuarters.indexOf(qyy.charAt(0)) + 1}`;
+  return `20${qyy.substring(1, 3)}${shortQuarters.indexOf(qyy) + 1}`;
 };
 

[Timeout] ArithmeticOperator
src/main/utils/quarterUtilities.js:20:37
 };
 
 const qyyToYyyyq = (qyy) => {
-  return `20${qyy.substring(1, 3)}${shortQuarters.indexOf(qyy.charAt(0)) + 1}`;
+  return `20${qyy.substring(1, 3)}${shortQuarters.indexOf(qyy.charAt(0)) - 1}`;
 };
 

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:35:7
 };
 
 const fromNumericYYYYQ = (yyyyqInt) => {
-  if (typeof yyyyqInt != "number") {
+  if (typeof yyyyqInt == "number") {
     throw new Error("param should be a number");
   }
killedBy: QuarterFormSelect conversion tests fromNumericYYYYQ correctly converts
statusReason: Error: param should be a number

[Killed] BlockStatement
src/main/utils/quarterUtilities.js:50:37
 };
 
 const toNumericYYYYQ = (yyyyqStr) => {
-  if (typeof yyyyqStr !== "string") {
-    throw new Error("param should be a string");
-  }
+  if (typeof yyyyqStr !== "string") {}
   if (yyyyqStr.length !== 5) {
     throw new Error("param should be five digits");
killedBy: QuarterFormSelect conversion tests toNumericYYYYQ correctly throws errors
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "param should be a string"
Received message:   "param should be five digits"

      138 |       } else {
      139 |         stryCov_9fa48("255");
    > 140 |         throw new Error(stryMutAct_9fa48("256") ? "" : (stryCov_9fa48("256"), "param should be five digits"));

[Timeout] StringLiteral
src/main/utils/quarterUtilities.js:51:21
 
 const toNumericYYYYQ = (yyyyqStr) => {
   if (typeof yyyyqStr !== "string") {
-    throw new Error("param should be a string");
+    throw new Error("");
   }
   if (yyyyqStr.length !== 5) {

[Killed] EqualityOperator
src/main/utils/quarterUtilities.js:67:7
   const _yyyyqStr = fromNumericYYYYQ(yyyyqInt); // just for type/format checking
   const qInt = yyyyqInt % 10;
   const yyyyInt = Math.floor(yyyyqInt / 10);
-  if (qInt < 4) {
+  if (qInt <= 4) {
     return yyyyqInt + 1;
   }
killedBy: CourseOverTimeSearchForm tests when I select a start quarter, the state for start quarter changes
statusReason: Error: param should end in 1,2,3 or 4

[Killed] ArithmeticOperator
src/main/utils/quarterUtilities.js:70:11
   if (qInt < 4) {
     return yyyyqInt + 1;
   }
-  return (yyyyInt + 1) * 10 + 1;
+  return (yyyyInt - 1) * 10 + 1;
 };
 
killedBy: BasicCourseSearchForm tests when I select a quarter, the state for quarter changes
statusReason: Error: param should be five digits

[Killed] ConditionalExpression
src/main/utils/quarterUtilities.js:79:5
   const endYYYYQInt = toNumericYYYYQ(endYYYYQStr);
   for (
     let yyyyqInt = beginYYYYQInt;
-    yyyyqInt <= endYYYYQInt;
+    false;
     yyyyqInt = nextQuarter(yyyyqInt)
   ) {
killedBy: AdminJobsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'yyyyq')
