[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:45:5
 
       Cell: ({ cell: { value } }) => value,
     },
-    {
-      Header: "Course ID",
-      accessor: "courseInfo.courseId",
-      aggregate: getCourseId,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-
-      Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
-    },
+    {},
     {
       Header: "Title",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:53:5
 
       Cell: ({ cell: { value } }) => value.substring(0, value.length - 2),
     },
-    {
-      Header: "Title",
-      accessor: "courseInfo.title",
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       // Stryker disable next-line StringLiteral: this column is hidden, very hard to test
killedBy: CourseOverTimeIndexPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:72:24
         <Button
           variant={"primary"}
           onClick={() => infoCallback(cell)}
-          data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
+          data-testid={``}
         >
           {"ℹ"}
killedBy: Section tests Has the expected column headers and content
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:78:5
         </Button>
       ),
     },
-    {
-      Header: "Status",
-      accessor: (row) => {
-        if (isSectionCancelled(row.section)) return "CANCELLED";
-        else if (isSectionClosed(row.section)) return "CLOSED";
-        else if (isSectionFull(row.section)) return "FULL";
-        else return "OPEN";
-      },
-      id: "status",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Enrolled",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:95:11
       Header: "Enrolled",
       accessor: (row) =>
         convertToFraction(row.section.enrolledTotal, row.section.maxEnroll),
-      id: "enrolled",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-0-col-enrolled"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:108:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Days",
-      accessor: (row) => formatDays(row.section.timeLocations),
-      id: "days",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Time",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Sections/SectionsOverTimeTable.js:116:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Time",
-      accessor: (row) => formatTime(row.section.timeLocations),
-      id: "time",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Instructor",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsOverTimeTable.js:140:18
     },
   ];
 
-  const testid = "SectionsOverTimeTable";
+  const testid = "";
 
   const columnsToDisplay = columns;
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsOverTimeTable-cell-row-0-col-quarter"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
