[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:34:5
   };
   // Stryker restore all
   const columns = [
-    {
-      Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.courseInfo.quarter),
-      id: "quarter",
-
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Course ID",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Sections/SectionsTable.js:81:11
         else if (isSectionFull(row.section)) return "FULL";
         else return "OPEN";
       },
-      id: "status",
+      id: "",
 
       aggregate: getFirstVal,
killedBy: Section tests Has the expected cell values when expanded
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SectionsTable-cell-row-0-col-status"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/Sections/SectionsTable.js:103:5
       aggregate: getFirstVal,
       Aggregated: ({ cell: { value } }) => `${value}`,
     },
-    {
-      Header: "Days",
-      accessor: (row) => formatDays(row.section.timeLocations),
-      id: "days",
-      aggregate: getFirstVal,
-      Aggregated: ({ cell: { value } }) => `${value}`,
-    },
+    {},
     {
       Header: "Time",
killedBy: Section tests renders without crashing for empty table
statusReason: Error: A column ID (or string accessor) is required!
