[Killed] MethodExpression
src/main/utils/quarterUtilities.js:20:15
 };
 
 const qyyToYyyyq = (qyy) => {
-  return `20${qyy.substring(1, 3)}${shortQuarters.indexOf(qyy.charAt(0)) + 1}`;
+  return `20${qyy}${shortQuarters.indexOf(qyy.charAt(0)) + 1}`;
 };
 
killedBy: Section tests Info button navigates to the course details page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/coursedetails/20221/12583"
Received: "/coursedetails/20W221/12583"

Number of calls: 1

<html>
