[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.js:15:5
 export default function CourseDetailsTable({ courses }) {
   console.log(courses);
   const columns = [
-    {
-      Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.quarter),
-      id: "quarter",
-    },
+    {},
     {
       Header: "Course ID",
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:17:17
   const columns = [
     {
       Header: "Quarter",
-      accessor: (row) => yyyyqToQyy(row.quarter),
+      accessor: () => undefined,
       id: "quarter",
     },
killedBy: CourseTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W23
Received:

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:26:17
     },
     {
       Header: "Enroll Code",
-      accessor: (row) => row.classSections[0].enrollCode,
+      accessor: () => undefined,
       id: "enrollCode",
     },
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  07492
Received:

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:31:17
     },
     {
       Header: "Section",
-      accessor: (row) => row.classSections[0].section,
+      accessor: () => undefined,
       id: "section",
     },
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  0102
Received:

[Killed] StringLiteral
main/components/CourseDetails/CourseDetailsTable.js:32:11
     {
       Header: "Section",
       accessor: (row) => row.classSections[0].section,
-      id: "section",
+      id: "",
     },
     {
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-section"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/components/CourseDetails/CourseDetailsTable.js:52:5
       accessor: (row) => formatLocation(row.classSections[0].timeLocations),
       id: "location",
     },
-    {
-      Header: "Days",
-      accessor: (row) => row.classSections[0].timeLocations[0].days,
-      id: "days",
-    },
+    {},
     {
       Header: "Time",
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ArrowFunction
main/components/CourseDetails/CourseDetailsTable.js:54:17
     },
     {
       Header: "Days",
-      accessor: (row) => row.classSections[0].timeLocations[0].days,
+      accessor: () => undefined,
       id: "days",
     },
killedBy: CourseTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  T R
Received:

[Killed] StringLiteral
main/components/CourseDetails/CourseDetailsTable.js:55:11
     {
       Header: "Days",
       accessor: (row) => row.classSections[0].timeLocations[0].days,
-      id: "days",
+      id: "",
     },
     {
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-days"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
