[Killed] ObjectLiteral
main/pages/CourseDetails/CourseDetailsPage.js:16:5
   } = useBackend(
     // Stryker disable next-line all : hard to test for query caching
     [`/api/sections/sectionsearch?qtr=${yyyyq}&enrollCode=${enrollCd}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/sections/sectionsearch?qtr=${yyyyq}&enrollCode=${enrollCd}`,
-      params: {
-        yyyyq,
-        enrollCd,
-      },
-    },
+    {},
   );
 
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-quarter"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsPage.js:31:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details</h1>
-        {courseDetail && <CourseDetailsTable courses={[courseDetail]} />}
+        {false}
       </div>
     </BasicLayout>
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-quarter"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/CourseDetails/CourseDetailsPage.js:31:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Course Details</h1>
-        {courseDetail && <CourseDetailsTable courses={[courseDetail]} />}
+        {true}
       </div>
     </BasicLayout>
killedBy: Course Details Page tests Calls UCSB Section Search api correctly and displays correct information
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="CourseDetailsTable-cell-row-0-col-quarter"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
